#+TITLE: Devlog
#+AUTHOR: lloydlobo
#+DESCRIPTION: Developer Log Notes
#+STARTUP: fold
#+OPTIONS: num:nil ^:{}
-----

****** cat <file> | grep -c : Show matching line & its number
#+begin_src shell
cat ~/.bashrc | grep -c x | less
#+end_src

#+RESULTS:
: 48
***** fd <pattern> --exec <cmd> | less | grep <search_string>
#+begin_src shell
fd bash --exec cat -n | less | grep export
#+end_src

#+RESULTS:
: 06:51  ➜  fd bash --exec cat -n | less | grep export
:     5  export GO111MODULE=on
:     7  export GO111MODULE=on
:    30  export GO111MODULE=off
:     6  export GO111MODULE=on
:    31  export GO111MODULE=off
:     5  export GO111MODULE=on
:     7  export GO111MODULE=off
:     5  export GO111MODULE=on
:     5  export GONOSUMDB=*/text # rsc.io/text but not golang.org/x/text
:    44                  "SC2034", // PREFIX appears unused. Verify it or export it.
:    44                  "SC2034", // PREFIX appears unused. Verify it or export it.

***** sort | cat
#+begin_src shell
sort ~/hist.org | cat -n
#+end_src

#+RESULTS:
| 1 |       |
| 2 | apple |
| 3 | hello |
| 4 | world |

***** Highlight lines that do not have ‘a’ & output result in reverse order.
#+begin_src shell
cat -n ~/hist.org | grep -v a | sort -r
cat -n ~/hist.org | grep -l a
#+end_src

#+RESULTS:
| 6	-1           |
| 5	11           |
| 4	1            |
| 2	world        |
| 1	hello        |
| (standard input) |

